interface EVENTIF {
  year: string;
  description: string;
  image: string;
  source: string;
}

export const events: EVENTIF[] = [
  {
    year: "1000",
    description:
      "يعتقد الباحثون أن هذه الكنيسة تأسست في القرن الحادي عشر الميلادي أو ما قبل ذلك أي في عهد الأسقف أنبا أبادير الذي سيم بيد البابا شنوده الثاني بعد سنة 1032م وكان أبادير قمصا وكيلا لمطرانية أسيوط في ذاك الوقت وربما سمي بهذا الاسم تيمنا بشفيع الكنيسة والمدينة ",
    image: "/image/events/event1.jpg",
    source: "",
  },
  {
    year: "1424",
    description:
      "في مخطوط 129/261 بكنيسة طوخ دلكة وهو ميمر لأحد أساقفة أسيوط ( وهو غالبا أنبا يوأنس مؤلف إبصالية الأحد أي ناهتي ) في القرن الخامس عشر نحو سنة 1424م يمدح فيه القديس ساويروس الأنطاكي اذكر يا ساويروس تادرس ابن يوحنا الشطبي وتادرس ابن واسيليدس والسيد ابادير كيف صاروا الى الغربة لأجل الاسم الحلو الذي لربنا يسوع المسيح",
    image: "/image/events/event2.jpg",
    source: " مخطوط 129/261 بكنيسة طوخ دلكة وهو ميمر لأحد أساقفة أسيوط",
  },
  {
    year: "1671",
    description:
      "في اسيوط كنيسة الطوباوي أبادير - مدينة اسيوط - هذه حسنة جداً. وتقع نحو الغرب.",
    image: "/image/events/event3.jpg",
    source: "الفصل السادس من الجزء الثالث عن حالة الأقباط الكنسية",
  },
  {
    year: "1791",
    description:
      "يوجد في مكتبة الدار البطريركية مخطوط يحمل رقم 874 مسلسل / 238 طقس: مردات المزامير المقرونة في جمعة الالام بالقبطية، ومزامير وأناجيل الساعة الثانية عشر من يوم الجمعة الكبيرة بنهرين، والبركة التي تقال قبل السيرة بالقبطية. يرجع تاريخ هذا المخطوط الى 26 بابه سنة 1508 للشهداء - 1791 ميلاديا، كُنب هذا المخطوط بخط القمص اقلاديوس خادم كنيسة الشهيد ابادير وايرائي اخته بأسيوط",
    image: "/image/events/event4.jpg",
    source: "مخطوط 874 مسلسل / 238 طقس",
  },
  {
    year: "1792",
    description:
      "ويوجد أيضاً بمكتبة الدار البطريركية مخطوط يحمل 876 مسلسل / 150 طقس يحتوي على خُطب لشهر كيهك والصوم الكبير بالعربية . ويرجع تاريخ هذا المخطوط إلى 24 برمهات سنة 1508 للشهداء - 1792 ميلادية، وهو وقف على كنيسة الشهيد أبادير وإيرائي أخته بأسيوط .",
    image: "/image/events/event5.jpg",
    source: "مخطوط  876 مسلسل / 150 طقس",
  },
  {
    year: "1799",
    description:
      "إطلع انبا اثناسيوس الأبوتيجي على مخطوط البصخة المقدسة في يوم احد الشعانين وأوقف هذا المخطوط على بيعة الشهيد العظيم أبادير وإيرائي اخته بناحية اسيوط عمرها الله على الدوام.",
    image: "/image/events/event6.jpg",
    source: "مخطوط البصخة المقدسة",
  },
  {
    year: "1800",
    description:
      "قام أنبا مكاريوس أسقف أسيوط (۱۷۹٦-۱۸۱۱م) في نهاية القرن الثامن عشر الميلادي بعمل حجاب للكنيسة تم رقم تصنيعه في المنوفية ، ولكنه أهداه لكنيسة العذراء المغيثة بحارة الروم بالقاهرة لإحتراقها في ذلك الوقت ، وإلى الآن يحمل اسم كنيسة الشهيد أبادير بأسيوط ، وغالباً تم عمل حجاب آخر بدلاً منه لكنيسة أسيوط",
    image: "/image/events/event9.jpg",
    source: "",
  },
  {
    year: "1801",
    description:
      "من المرجح أنه في القرن التاسع عشر ألحقت كنيسة السيدة العذراء بكنيسة الشهيد أبادير وكانت شمال شرق كنيسة الشهيد ابادير القديمة",
    image: "/image/events/event7.jpg",
    source: "",
  },
  {
    year: "1820",
    description:
      "اشترك الانبا ميخائيل الانطوني الذي خلف الانبا مكاريوس على اسقفية اسيوط ( 1811 - 1844 م) في عمل الميرون المقدس مع البابا بطرس الجاولي وكان مقر الاسقفيه بكنيسة الشهيد ابادير",
    image: "/image/events/event8.jpg",
    source: "",
  },
  {
    year: "1900",
    description:
      "كان يوجد حجاب خشبي، وقد قال بعض كبار السن بمدينة اسيوط ان الاجانب قد اخذوا هذا الحجاب لأوروبا ووضعوا حجاب رخامي بدلاً منه، وظل موجوداً بالكنيسة حتى تهدمت في الستينيات من القرن العشرين،وكان يشبه بشكل كبير حجاب كنيسة مارجرجس بدير المحرق والذي تم عمله في أواخر القرن التاسع عشر الميلادي، ويرجح ان الحجاب الرخامي لكنيستنا بأسيوط يرجع الى هذه الفترة. وفي نفس هذه الفترة تقريباً بنى انبا مكاريوس هيكلاً صغيراً فوق حجرة المعمودية جنوب شرق الكنيسة على اسم الأمير تادرس الشطبي ووضع به رافات الشهيد.",
    image: "/image/events/event10.jpg",
    source: "",
  },
  {
    year: "1936",
    description:
      "الانبا مكاريوس مطران اسيوط (1897 - 1945 م) قام بإنشاء مدرسة ودار لمرتلي الكنيسة بجوار الكنيسة من الناحية البحرية وأسماه بيت الرحمة، وتم نقل مقر المطرانية من كنيسة الشهيد ابادير الى كنيسة القديس مرقس الرسول في بداية القرن العشرين",
    image: "/image/events/event11.jpg",
    source: "",
  },
  {
    year: "1997",
    description:
      "تم إقامة اول قداس لنيافة الانبا ميخائيل مطران اسيوط (1946 - 2014 م) في كنيسة الشهيد ابادير بعد ان تم إعادة بناءها ، وذلك في يوم الاحد 24 بشنس الموافق اول يونيو 1997 م في تذكار عيد دخول السيد المسيح ارض مصر",
    image: "/image/events/event12.jpg",
    source: "",
  },
  {
    year: "2014",
    description:
      "كانت اول زيارة نيافة الانبا يؤانس اسقفنا المحبوب (2015 م - ادام الله حياتة) لكنيستنا المحبوبه وذلك يوم السبت 13 سبتمبر 2014 م حيث كان استقباله استقبالاً حافلاً مليئاً بالحب والبهجة وتم في هذا اليوم صلاة رفع بخور عشية وتسبحة نصف الليل ",
    image: "/image/events/event13.jpg",
    source: "",
  },
];
